# Lab 2 SQL Basics

In [28]:
import numpy as np
import pandas as pd
from pandasql import *
heroes = pd.read_csv("heroes_information.csv")

pysqldf = lambda q: sqldf(q,globals())

### 1. what is the first name in heroes table?

In [29]:
query = " SELECT * FROM heroes LIMIT 1"
pysqldf(query)

,id,name,Gender,Eye color,Race,Hair color,Height,Publisher,Skin color,Alignment,Weight
0,0,A-Bomb,Male,yellow,Human,No Hair,203.0,Marvel Comics,None,good,441.0

### 2. How many publisher exists?

In [30]:
query = "SELECT COUNT(DISTINCT Publisher) FROM heroes"
pysqldf(query)

   COUNT(DISTINCT Publisher)
0                         24

### 3. How many superheroes are taller than 2 meters (200 cms)?

In [31]:
query2 = "SELECT COUNT(*) FROM heroes WHERE Height > 200"
pysqldf(query2)

   COUNT(*)
0        59

### 4. How many superheroes are human and are taller than 2 meters (200 cms)?

In [32]:
query2 = "SELECT COUNT(*) FROM heroes WHERE Height > 200 AND race = 'Human'"
pysqldf(query2)

   COUNT(*)
0        12

### 5. How many superheroes weigh more than 100 lbs and less than 200 lbs?

In [33]:
query2 = "SELECT COUNT(*) FROM heroes WHERE Weight BETWEEN 100 AND 200"
pysqldf(query2)

   COUNT(*)
0        98

### 6.How many superheroes have blue or red eyes?

In [34]:
query2 = "SELECT COUNT(*) FROM heroes WHERE `Eye color` in ('red', 'blue')"
pysqldf(query2)

   COUNT(*)
0       271

### 7. How many superheroes are Human, Mutant and have Green hair or are Vampires with black hair?

In [35]:
query2 = "SELECT COUNT(*) FROM heroes WHERE (Race in ('Human', 'Mutant') AND `Hair color` = 'Green') OR (Race = 'Vampire' AND `Hair color` = 'Black')"
pysqldf(query2)

   COUNT(*)
0         5

### 8. What is the name of the first superhero if I sort the table by race in order falling?

In [36]:
query2 = "SELECT Name FROM heroes ORDER BY Race DESC LIMIT 1"
pysqldf(query2)

             name
0  Solomon Grundy

### 9. How many superheroes are male and how many female?

In [37]:
query2 = "SELECT Gender, count(*) FROM heroes GROUP BY Gender"
pysqldf(query2)

   Gender  count(*)
0    None        29
1  Female       200
2    Male       505

### 10. How many publishing houses have more than 15 superheroes?

In [38]:
query2 = "SELECT Publisher, count(name) FROM heroes GROUP BY Publisher HAVING COUNT(Publisher) > 15"
pysqldf(query2)

           Publisher  count(name)
0          DC Comics          215
1  Dark Horse Comics           18
2      Marvel Comics          388
3       NBC - Heroes           19